docs/CS/VersionControl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-20 Mon 15:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline13">1. SVN</a>
<ul>
<li><a href="#orgheadline1">1.1. svn checkout/co</a></li>
<li><a href="#orgheadline2">1.2. svn add</a></li>
<li><a href="#orgheadline3">1.3. svn propset</a></li>
<li><a href="#orgheadline4">1.4. svn delete</a></li>
<li><a href="#orgheadline5">1.5. svn status</a></li>
<li><a href="#orgheadline6">1.6. svn update/up</a></li>
<li><a href="#orgheadline7">1.7. svn commit/ci</a></li>
<li><a href="#orgheadline8">1.8. svn diff</a></li>
<li><a href="#orgheadline9">1.9. svn move</a></li>
<li><a href="#orgheadline10">1.10. svn commit</a></li>
<li><a href="#orgheadline11">1.11. svn log file</a></li>
<li><a href="#orgheadline12">1.12. svn up -r version name + file name:</a></li>
</ul>
</li>
<li><a href="#orgheadline33">2. GIT</a>
<ul>
<li><a href="#orgheadline14">2.1. update git version:</a></li>
<li><a href="#orgheadline16">2.2. 创建版本库</a>
<ul>
<li><a href="#orgheadline15">2.2.1. add remote after init.</a></li>
</ul>
</li>
<li><a href="#orgheadline17">2.3. 用命令git commit告诉Git，把文件提交到仓库：</a></li>
<li><a href="#orgheadline18">2.4. 查询git log</a></li>
<li><a href="#orgheadline19">2.5. 版本回退</a></li>
<li><a href="#orgheadline20">2.6. 撤销修改</a></li>
<li><a href="#orgheadline24">2.7. 创建与合并分支</a>
<ul>
<li><a href="#orgheadline21">2.7.1. master分支是一条线，Git用master指向最新的提交，再用HEAD指向master</a></li>
<li><a href="#orgheadline22">2.7.2. 当我们创建新的分支，例如dev时，Git新建了一个指针叫dev，指向master相同的提交，再把HEAD指向dev，就表示当前分支在dev上.</a></li>
<li><a href="#orgheadline23">2.7.3. 假如我们在dev上的工作完成了，就可以把dev合并到master上。Git怎么合并呢？最简单的方法，就是直接把master指向dev的当前提交，就完成了合并.</a></li>
</ul>
</li>
<li><a href="#orgheadline25">2.8. 解决冲突</a></li>
<li><a href="#orgheadline26">2.9. 分支管理策略</a></li>
<li><a href="#orgheadline27">2.10. Bug分支</a></li>
<li><a href="#orgheadline28">2.11. 多人协作</a></li>
<li><a href="#orgheadline30">2.12. Switching remote URLs from HTTPS to SSH</a>
<ul>
<li><a href="#orgheadline29">2.12.1. Change your remote's URL from HTTPS to SSH with the git remote set-url command.</a></li>
</ul>
</li>
<li><a href="#orgheadline31">2.13. remove remote</a></li>
<li><a href="#orgheadline32">2.14. sub modules</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">1</span> SVN</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> svn checkout/co</h3>
<div class="outline-text-3" id="text-1-1">
<p>
svn checkout or svn co. This command is used to pull an SVN tree such as svn://linuxfromscratch.org/BLFS/trunk/BOOK (the BLFS Development book) from the server.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> svn add</h3>
<div class="outline-text-3" id="text-1-2">
<p>
svn add. When you are creating a new file or directory, you need to tell the SVN server about it. This command does that. Note that the file won't appear in the repository until you do an svn commit (see below).
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> svn propset</h3>
<div class="outline-text-3" id="text-1-3">
<p>
svn propset. When you are creating a new file or directory, you generally need to tell the SVN to apply properties to the file in places that have keywords in a special format such as $Date: 2012-07-29 17:46:27 -0600 (Sun, 29 Jul 2012) $. Note that the keyword value won't appear in the file until you do an svn commit (see below).
</p>

<p>
Normally, the command you want is
</p>
<div class="org-src-container">

<pre class="src src-shell">svn propset svn:keywords <span style="color: #E6DB74;">"Date LastChangedBy"</span> /path/to/filename.xml
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> svn delete</h3>
<div class="outline-text-3" id="text-1-4">
<p>
svn delete. This does what it says! When you do an svn commit the file will be deleted from your local sand box immediately as well as from the repository after committing.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> svn status</h3>
<div class="outline-text-3" id="text-1-5">
<p>
svn status. This command prints the status of working directories and files. If you have made local changes, it'll show your locally modified items. If you use the &#x2013;verbose switch, it will show revision information on every item. With the &#x2013;show-updates (-u) switch, it will show any server out-of-date information.
</p>

<p>
You should always do a manual svn status &#x2013;show-updates before trying to commit changes in order to check that everything is OK and ready to go.
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.6</span> svn update/up</h3>
<div class="outline-text-3" id="text-1-6">
<p>
svn update or svn up. svn update brings changes from the repository into your working copy. If no revision given, it brings your working copy up-to-date with the HEAD revision. Otherwise, it synchronizes the working copy to the revision given by the &#x2013;revision switch. As part of the synchronization, svn update also removes any stale locks (see the section called “svn cleanup”) found in the working copy.
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.7</span> svn commit/ci</h3>
<div class="outline-text-3" id="text-1-7">
<p>
svn commit or svn ci. This command recursively sends your changes to the SVN server. It will commit changed files, added files, and deleted files. Note that you can commit a change to an individual file or changes to files in a specific directory path by adding the name of the file/directory to the end of the command. The -m option should always be used to pass a log message to the command. Please don't use empty log messages (see later in this document the policy which governs the log messages).
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">1.8</span> svn diff</h3>
<div class="outline-text-3" id="text-1-8">
<p>
svn diff. This is useful for two different purposes. First, those without write access to the BLFS SVN server can use it to generate patches to send to the BLFS-Dev mailing list. To do this, simply edit the files in your local sand box then run svn diff &gt; FILE.patch from the root of your BLFS directory. You can then attach this file to a message to the BLFS-Dev mailing list where someone with editing rights can pick it up and apply it to the book. The second use is to find out what has changed between two revisions using: svn diff -r revision1:revision2 FILENAME. For example: svn diff -r 168:169 index.xml will output a diff showing the changes between revisions 168 and 169 of index.xml.
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">1.9</span> svn move</h3>
<div class="outline-text-3" id="text-1-9">
<p>
svn move SRC DEST or svn mv SRC DEST or svn rename SRC DEST or svn ren SRC DEST. This command moves a file from one directory to another or renames a file. The file will be moved on your local sand box immediately as well as on the repository after committing.
</p>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">1.10</span> svn commit</h3>
<div class="outline-text-3" id="text-1-10">
<div class="org-src-container">

<pre class="src src-shell">svn ci -m <span style="color: #E6DB74;">"Added new package baldrick"</span> filename
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">1.11</span> svn log file</h3>
<div class="outline-text-3" id="text-1-11">
<p>
check file log.
</p>
<div class="org-src-container">

<pre class="src src-shell">svn log file
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">1.12</span> svn up -r version name + file name:</h3>
<div class="outline-text-3" id="text-1-12">
<p>
reverse file back to a version.
</p>
<div class="org-src-container">

<pre class="src src-shell">svn up -r r12332 file.py
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline33" class="outline-2">
<h2 id="orgheadline33"><span class="section-number-2">2</span> GIT</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">2.1</span> update git version:</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-shell">sudo apt-get install python-software-properties software-properties-common
sudo add-apt-repository ppa:git-core/ppa -y
sudo apt-get update
sudo apt-get install git -y
git --version
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">2.2</span> 创建版本库</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">$ mkdir learngit
$ cd learngit
$ pwd
/Users/michael/learngit
# &#36890;&#36807;git init&#21629;&#20196;&#25226;&#36825;&#20010;&#30446;&#24405;&#21464;&#25104;Git&#21487;&#20197;&#31649;&#29702;&#30340;&#20179;&#24211;&#65306;
$ git init
Initialized empty Git repository in /Users/michael/learngit/.git/
</pre>
</div>
<p>
千万不要使用Windows自带的记事本编辑任何文本文件。原因是Microsoft开发记事本的团队使用了一个非常弱智的行为来保存UTF-8编码的文件，他们自作聪明地在每个文件开头添加了0xefbbbf（十六进制）的字符，你会遇到很多不可思议的问题，比如，网页第一行可能会显示一个“?”，明明正确的程序一编译就报语法错误，等等，都是由记事本的弱智行为带来的。
</p>
</div>
<div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="section-number-4">2.2.1</span> add remote after init.</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">

<pre class="src src-shell">git remote add origin remote-repository-URL
git push --set-upstream origin master
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">2.3</span> 用命令git commit告诉Git，把文件提交到仓库：</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">$ git commit -m <span style="color: #E6DB74;">"wrote a readme file"</span>
<span style="color: #AE81FF;">[</span>master <span style="color: #66D9EF;">(</span>root-commit<span style="color: #66D9EF;">)</span> cb926e7<span style="color: #AE81FF;">]</span> wrote a readme file
 <span style="color: #AE81FF;">1</span> file changed, <span style="color: #AE81FF;">2</span> insertions<span style="color: #AE81FF;">(</span>+<span style="color: #AE81FF;">)</span>
 create mode <span style="color: #AE81FF;">100644</span> readme.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">2.4</span> 查询git log</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-shell">git log -g --grep=update
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">2.5</span> 版本回退</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>HEAD指向的版本就是当前版本，因此，Git允许我们在版本的历史之间穿梭，使用命令git reset &#x2013;hard commit_id</li>
<li>用git log可以查看提交历史，以便确定要回退到哪个版本。</li>
<li>用git reflog查看命令历史，以便确定要回到未来的哪个版本。</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">$ git log --pretty=oneline # &#22914;&#26524;&#23244;&#36755;&#20986;&#20449;&#24687;&#22826;&#22810;&#65292;&#30475;&#24471;&#30524;&#33457;&#32557;&#20081;&#30340;&#65292;&#21487;&#20197;&#35797;&#35797;&#21152;&#19978;--pretty=oneline&#21442;&#25968;&#65306;
3628164fb26d48395383f8f31179f24e0882e1e0 append GPL
ea34578d5496d7dd233c827ed32a8cd576c5ee85 add distributed
cb926e7ea50ad11b8f9e909c05226233bf755030 wrote a readme file

$ git reset --hard HEAD^
HEAD is now at ea34578 add distributed
</pre>
</div>

<ul class="org-ul">
<li><b>push the editted previous version</b></li>
</ul>
<div class="org-src-container">

<pre class="src src-shell">$ git push -f origin
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">2.6</span> 撤销修改</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">$ git checkout -- readme.txt
</pre>
</div>
<p>
用命令git reset HEAD file可以把暂存区的修改撤销掉（unstage），重新放回工作区：
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">$ git reset HEAD readme.txt
Unstaged changes after reset:
M       readme.txt
</pre>
</div>

<ul class="org-ul">
<li>give up unstaged or modified files.</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">git clean -df
git checkout -- .
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">2.7</span> 创建与合并分支</h3>
<div class="outline-text-3" id="text-2-7">
</div><div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">2.7.1</span> master分支是一条线，Git用master指向最新的提交，再用HEAD指向master</h4>
</div>

<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">2.7.2</span> 当我们创建新的分支，例如dev时，Git新建了一个指针叫dev，指向master相同的提交，再把HEAD指向dev，就表示当前分支在dev上.</h4>
</div>

<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">2.7.3</span> 假如我们在dev上的工作完成了，就可以把dev合并到master上。Git怎么合并呢？最简单的方法，就是直接把master指向dev的当前提交，就完成了合并.</h4>
<div class="outline-text-4" id="text-2-7-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">$ git checkout master
Switched to branch 'master'

$ git merge dev
Updating d17efd8..fec145a
Fast-forward
 readme.txt |    <span style="color: #AE81FF;">1</span> +
 <span style="color: #AE81FF;">1</span> file changed, <span style="color: #AE81FF;">1</span> insertion<span style="color: #AE81FF;">(</span>+<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">2.8</span> 解决冲突</h3>
<div class="outline-text-3" id="text-2-8">
<p>
用带参数的git log也可以看到分支的合并情况：
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">$ git log --graph --pretty=oneline --abbrev-commit
   59bc1cb conflict fixed
|\
| * 75a857c AND simple
 | 400b400 &amp; simple
|/
 fec145a branch test
...
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">2.9</span> 分支管理策略</h3>
<div class="outline-text-3" id="text-2-9">
<p>
准备合并dev分支，请注意&#x2013;no-ff参数，表示禁用Fast forward：
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">$ git merge --no-ff -m <span style="color: #E6DB74;">"merge with no-ff"</span> dev
</pre>
</div>
<p>
在实际开发中，我们应该按照几个基本原则进行分支管理：
</p>

<p>
首先，master分支应该是非常稳定的，也就是仅用来发布新版本，平时不能在上面干活；
</p>

<p>
那在哪干活呢？干活都在dev分支上，也就是说，dev分支是不稳定的，到某个时候，比如1.0版本发布时，再把dev分支合并到master上，在master分支发布1.0版本；
</p>

<p>
你和你的小伙伴们每个人都在dev分支上干活，每个人都有自己的分支，时不时地往dev分支上合并就可以了。
</p>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">2.10</span> Bug分支</h3>
<div class="outline-text-3" id="text-2-10">
<ul class="org-ul">
<li>当你接到一个修复一个代号101的bug的任务时，很自然地，你想创建一个分支issue-101来修复它，但是，等等，当前正在dev上进行的工作还没有提交：</li>
<li>并不是你不想提交，而是工作只进行到一半，还没法提交，预计完成还需1天时间。但是，必须在两个小时内修复该bug，怎么办？</li>
</ul>
<p>
幸好，Git还提供了一个stash功能，可以把当前工作现场“储藏”起来，等以后恢复现场后继续工作：
</p>
<ul class="org-ul">
<li>首先确定要在哪个分支上修复bug，假定需要在master分支上修复，就从master创建临时分支：</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">$ git stash
Saved working directory and index state WIP on dev: <span style="color: #AE81FF;">6224937</span> add merge
HEAD is now at <span style="color: #AE81FF;">6224937</span> add merge
$ git checkout master
Switched to branch 'master'
Your branch is ahead of 'origin/master' by <span style="color: #AE81FF;">6</span> commits.
$ git checkout -b issue-101
Switched to a new branch 'issue-101'
$ git add readme.txt
$ git commit -m <span style="color: #E6DB74;">"fix bug 101"</span>
<span style="color: #AE81FF;">[</span>issue-101 cc17032<span style="color: #AE81FF;">]</span> fix bug <span style="color: #AE81FF;">101</span>
 <span style="color: #AE81FF;">1</span> file changed, <span style="color: #AE81FF;">1</span> insertion<span style="color: #AE81FF;">(</span>+<span style="color: #AE81FF;">)</span>, <span style="color: #AE81FF;">1</span> deletion<span style="color: #AE81FF;">(</span>-<span style="color: #AE81FF;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>修复完成后，切换到master分支，并完成合并，最后删除issue-101分支：</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">$ git checkout master
Switched to branch 'master'
Your branch is ahead of 'origin/master' by <span style="color: #AE81FF;">2</span> commits.
$ git merge --no-ff -m <span style="color: #E6DB74;">"merged bug fix 101"</span> issue-101
Merge made by the 'recursive' strategy.
 readme.txt |    <span style="color: #AE81FF;">2</span> +-
 <span style="color: #AE81FF;">1</span> file changed, <span style="color: #AE81FF;">1</span> insertion<span style="color: #AE81FF;">(</span>+<span style="color: #AE81FF;">)</span>, <span style="color: #AE81FF;">1</span> deletion<span style="color: #AE81FF;">(</span>-<span style="color: #AE81FF;">)</span>
$ git branch -d issue-101
Deleted branch issue-101 <span style="color: #AE81FF;">(</span>was cc17032<span style="color: #AE81FF;">)</span>.
</pre>
</div>
<ul class="org-ul">
<li>工作区是干净的，刚才的工作现场存到哪去了？用git stash list命令看看：</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">$ git checkout dev
Switched to branch 'dev'
$ git status
# On branch dev
nothing to commit <span style="color: #AE81FF;">(</span>working directory clean<span style="color: #AE81FF;">)</span>
$ git stash list
stash@{0}: WIP on dev: <span style="color: #AE81FF;">6224937</span> add merge
</pre>
</div>
<p>
需要恢复一下，有两个办法：
</p>

<p>
一是用git stash apply恢复，但是恢复后，stash内容并不删除，你需要用git stash drop来删除；
</p>

<p>
另一种方式是用git stash pop，恢复的同时把stash内容也删了：
</p>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">2.11</span> 多人协作</h3>
<div class="outline-text-3" id="text-2-11">
<p>
推送失败，因为你的小伙伴的最新提交和你试图推送的提交有冲突，解决办法也很简单，Git已经提示我们，先用git pull把最新的提交从origin/dev抓下来，然后，在本地合并，解决冲突，再推送.
</p>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">2.12</span> Switching remote URLs from HTTPS to SSH</h3>
<div class="outline-text-3" id="text-2-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp">git remote -v
origin  https://github.com/USERNAME/REPOSITORY.git <span style="color: #AE81FF;">(</span>fetch<span style="color: #AE81FF;">)</span>
origin  https://github.com/USERNAME/REPOSITORY.git <span style="color: #AE81FF;">(</span>push<span style="color: #AE81FF;">)</span>

git@github.com:leolle/leolle.github.io.git
github.com:leolle/leolle.github.io.git
git@github.com:leolle/notes.git
</pre>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">2.12.1</span> Change your remote's URL from HTTPS to SSH with the git remote set-url command.</h4>
<div class="outline-text-4" id="text-2-12-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">git remote set-url origin git@github.com:USERNAME/REPOSITORY.git
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">2.13</span> remove remote</h3>
<div class="outline-text-3" id="text-2-13">
<div class="org-src-container">

<pre class="src src-emacs-lisp">git remote rm xxx
</pre>
</div>

<p>
opposite operation:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">git remote add origin git@github.git
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">2.14</span> sub modules</h3>
<div class="outline-text-3" id="text-2-14">
<div class="org-src-container">

<pre class="src src-shell"><span style="color: #75715E;"># </span><span style="color: #75715E;">1.</span>
git submodule add https://github.com/chaconinc/DbConnector
<span style="color: #75715E;"># </span><span style="color: #75715E;">2. Cloning a Project with Submodules</span>
git clone https://github.com/chaconinc/MainProject
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
